In [3]:
import matplotlib.pyplot as plt
import pandas as pd
import plotly.express as px

In [2]:
%%bash 
pwd

/mnt/c/Users/Shahirul Islam Polak/Documents/vstoolbox/git/New folder/wqu_notes/DS_ASSIGN/010-housing-in-mexico

**Task 1.5.1:** Import the CSV file `data/brasil-real-estate-1.csv` into the DataFrame `df1`.

In [9]:
df1 = pd.read_csv("brasil-real-estate-1.csv")
df1.head()

,Unnamed: 0,property_type,place_with_parent_names,region,lat-lon,area_m2,price_usd
0,0,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6443051,-35.7088142",110.0,"$187,230.85"
1,1,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6430934,-35.70484",65.0,"$81,133.37"
2,2,house,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6227033,-35.7297953",211.0,"$154,465.45"
3,3,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.622837,-35.719556",99.0,"$146,013.20"
4,4,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.654955,-35.700227",55.0,"$101,416.71"

In [ ]:
wqet_grader.grade("Project 1 Assessment", "Task 1.5.1", df1)

In [10]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12834 entries, 0 to 12833
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               12834 non-null  int64
 1   property_type            12834 non-null  object
 2   place_with_parent_names  12834 non-null  object
 3   region                   12834 non-null  object
 4   lat-lon                  11551 non-null  object
 5   area_m2                  12834 non-null  float64
 6   price_usd                12834 non-null  object
dtypes: float64(1), int64(1), object(5)
memory usage: 702.0+ KB

**Task 1.5.2:** Drop all rows with `NaN` values from the DataFrame `df1`.

In [11]:
# Remove 'Nan' values

df1.dropna(inplace=True)

#Transform price from object to float
df1["price_usd"] = (
    df1["price_usd"]
    .str.replace("$", "", regex=False)
    .str.replace(",", "")
    .astype(float)
)

In [12]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 11551 entries, 0 to 12833
Data columns (total 7 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               11551 non-null  int64
 1   property_type            11551 non-null  object
 2   place_with_parent_names  11551 non-null  object
 3   region                   11551 non-null  object
 4   lat-lon                  11551 non-null  object
 5   area_m2                  11551 non-null  float64
 6   price_usd                11551 non-null  float64
dtypes: float64(2), int64(1), object(4)
memory usage: 721.9+ KB

In [13]:
df1.head()

,Unnamed: 0,property_type,place_with_parent_names,region,lat-lon,area_m2,price_usd
0,0,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6443051,-35.7088142",110.0,187230.85
1,1,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6430934,-35.70484",65.0,81133.37
2,2,house,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6227033,-35.7297953",211.0,154465.45
3,3,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.622837,-35.719556",99.0,146013.20
4,4,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.654955,-35.700227",55.0,101416.71

In [ ]:
wqet_grader.grade("Project 1 Assessment", "Task 1.5.2", df1)

**Task 1.5.3:** Use the `"lat-lon"` column to create two separate columns in `df1`: `"lat"` and `"lon"`. Make sure that the data type for these new columns is `float`.

In [14]:
df1[["lat", "lon"]] = df1["lat-lon"].str.split(",", expand=True)

df1.head(10)

,Unnamed: 0,property_type,place_with_parent_names,region,lat-lon,area_m2,price_usd,lat,lon
0,0,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6443051,-35.7088142",110.0,187230.85,-9.6443051,-35.7088142
1,1,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6430934,-35.70484",65.0,81133.37,-9.6430934,-35.70484
2,2,house,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6227033,-35.7297953",211.0,154465.45,-9.6227033,-35.7297953
3,3,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.622837,-35.719556",99.0,146013.20,-9.622837,-35.719556
4,4,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.654955,-35.700227",55.0,101416.71,-9.654955,-35.700227
5,5,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.614414,-35.735621",56.0,75727.07,-9.614414,-35.735621
6,6,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.584755,-35.662909",68.0,110916.18,-9.584755,-35.662909
7,7,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.658285,-35.703827",187.0,249641.14,-9.658285,-35.703827
9,9,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.66082,-35.702976",90.0,115459.02,-9.66082,-35.702976
10,10,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6637998,-35.7115455",137.0,361979.65,-9.6637998,-35.7115455

In [ ]:
df1.drop(columns=["lat-lon"], inplace=True)

df1.head()

**Task 1.5.4:** Use the `"place_with_parent_names"` column to create a `"state"` column for `df1`. (Note that the state name always appears after `"|Brasil|"` in each string.)

In [32]:
df1["state"] = df1["place_with_parent_names"].str.split("|", expand=True)[2]

In [33]:
df1.head()

,Unnamed: 0,property_type,place_with_parent_names,region,lat-lon,area_m2,price_usd,lat,lon,state
0,0,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6443051,-35.7088142",110.0,187230.85,-9.6443051,-35.7088142,Alagoas
1,1,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6430934,-35.70484",65.0,81133.37,-9.6430934,-35.70484,Alagoas
2,2,house,|Brasil|Alagoas|Macei贸|,Northeast,"-9.6227033,-35.7297953",211.0,154465.45,-9.6227033,-35.7297953,Alagoas
3,3,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.622837,-35.719556",99.0,146013.20,-9.622837,-35.719556,Alagoas
4,4,apartment,|Brasil|Alagoas|Macei贸|,Northeast,"-9.654955,-35.700227",55.0,101416.71,-9.654955,-35.700227,Alagoas

In [ ]:

wqet_grader.grade("Project 1 Assessment", "Task 1.5.4", df1)

**Task 1.5.5:** Transform the `"price_usd"` column of `df1` so that all values are floating-point numbers instead of strings.

In [ ]:
#Transform price from object to float
df1["price_usd"] = (
    df1["price_usd"]
    .str.replace("$", "", regex=False)
    .str.replace(",", "")
    .astype(float)
)

In [ ]:

wqet_grader.grade("Project 1 Assessment", "Task 1.5.5", df1)

**Task 1.5.6:** Drop the `"lat-lon"` and `"place_with_parent_names"` columns from `df1`.

In [ ]:
# Drop cols
df1.drop(columns=["place_with_parent_names", "lat-lon"], inplace=True)

df1.head()

In [41]:
df1.head()

,Unnamed: 0,property_type,region,area_m2,price_usd,lat,lon,state
0,0,apartment,Northeast,110.0,187230.85,-9.6443051,-35.7088142,Alagoas
1,1,apartment,Northeast,65.0,81133.37,-9.6430934,-35.70484,Alagoas
2,2,house,Northeast,211.0,154465.45,-9.6227033,-35.7297953,Alagoas
3,3,apartment,Northeast,99.0,146013.20,-9.622837,-35.719556,Alagoas
4,4,apartment,Northeast,55.0,101416.71,-9.654955,-35.700227,Alagoas

In [42]:
# Drop cols
df1.drop(columns=["Unnamed: 0"], inplace=True)

df1.head()

,property_type,region,area_m2,price_usd,lat,lon,state
0,apartment,Northeast,110.0,187230.85,-9.6443051,-35.7088142,Alagoas
1,apartment,Northeast,65.0,81133.37,-9.6430934,-35.70484,Alagoas
2,house,Northeast,211.0,154465.45,-9.6227033,-35.7297953,Alagoas
3,apartment,Northeast,99.0,146013.20,-9.622837,-35.719556,Alagoas
4,apartment,Northeast,55.0,101416.71,-9.654955,-35.700227,Alagoas

In [ ]:

wqet_grader.grade("Project 1 Assessment", "Task 1.5.6", df1)

**Task 1.5.7:** Import the CSV file `brasil-real-estate-2.csv` into the DataFrame `df2`.

In [ ]:
df2 = pd.read_csv("brasil-real-estate-2.csv")

In [43]:
df2.info()

NameError: name 'df2' is not defined

In [ ]:
import matplotlib.pyplot as plt
import pandas as pd
import plotly.express as px

In [44]:
df2 = pd.read_csv("brasil-real-estate-2.csv")
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12833 entries, 0 to 12832
Data columns (total 8 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Unnamed: 0     12833 non-null  int64
 1   property_type  12833 non-null  object
 2   state          12833 non-null  object
 3   region         12833 non-null  object
 4   lat            12833 non-null  float64
 5   lon            12833 non-null  float64
 6   area_m2        11293 non-null  float64
 7   price_brl      12833 non-null  float64
dtypes: float64(4), int64(1), object(3)
memory usage: 802.2+ KB

In [46]:
# Drop cols
df2.drop(columns=["Unnamed: 0"], inplace=True)

df2.head()

,property_type,state,region,lat,lon,area_m2,price_brl
0,apartment,Pernambuco,Northeast,-8.134204,-34.906326,72.0,414222.98
1,apartment,Pernambuco,Northeast,-8.126664,-34.903924,136.0,848408.53
2,apartment,Pernambuco,Northeast,-8.125550,-34.907601,75.0,299438.28
3,apartment,Pernambuco,Northeast,-8.120249,-34.895920,187.0,848408.53
4,apartment,Pernambuco,Northeast,-8.142666,-34.906906,80.0,464129.36

In [47]:
df2.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 12833 entries, 0 to 12832
Data columns (total 7 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   property_type  12833 non-null  object
 1   state          12833 non-null  object
 2   region         12833 non-null  object
 3   lat            12833 non-null  float64
 4   lon            12833 non-null  float64
 5   area_m2        11293 non-null  float64
 6   price_brl      12833 non-null  float64
dtypes: float64(4), object(3)
memory usage: 701.9+ KB

In [49]:
df2.shape

(12833, 7)

**Task 1.5.8:** Use the `"price_brl"` column to create a new column named `"price_usd"`. (Keep in mind that, when this data was collected in 2015 and 2016, a US dollar cost 3.19 Brazilian reals.)

**Task 1.5.11:** Use the `describe` method to create a DataFrame `summary_stats` with the summary statistics for the `"area_m2"` and `"price_usd"` columns.

In [ ]:
summary_stats = ...
summary_stats

In [ ]:

wqet_grader.grade("Project 1 Assessment", "Task 1.5.11", summary_stats)

**Task 1.5.12:** Create a histogram of `"price_usd"`. Make sure that the x-axis has the label `"Price [USD]"`, the y-axis has the label `"Frequency"`, and the plot has the title `"Distribution of Home Prices"`. Use Matplotlib (`plt`).

In [ ]:
# Build histogram
plt.hist(df['price_usd'])


# Label axes
plt.xlabel("Price [USD]")
plt.ylabel("Frequency")

# Add title
plt.title("Distribution of Home Prices")

# Don't change the code below 
plt.savefig("images/1-5-12.png", dpi=150)

In [ ]:
with open("images/1-5-12.png", "rb") as file:
    wqet_grader.grade("Project 1 Assessment", "Task 1.5.12", file)

**Task 1.5.13:** Create a horizontal boxplot of `"area_m2"`. Make sure that the x-axis has the label `"Area [sq meters]"` and the plot has the title `"Distribution of Home Sizes"`. Use Matplotlib (`plt`).

In [ ]:
# Build box plot
plt.boxplot()


# Label x-axis


# Add title


# Don't change the code below 
plt.savefig("images/1-5-13.png", dpi=150)

In [ ]:
with open("images/1-5-13.png", "rb") as file:
    wqet_grader.grade("Project 1 Assessment", "Task 1.5.13", file)